In [1]:
import pandas as pd

In [3]:
df = pd.read_csv(r'D:\Notes\Excel works\marks_dataset_with_blanks.csv',index_col='StudentID')
df

                 Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
StudentID
1          Anil Kumar     85.0         78   92.0       NaN   80.0     88.0
2          Bharathi R     90.0         80   88.0      94.0   85.0     55.0
3           Chandan S     78.0         84    NaN      86.0    NaN     81.0
4             Divya P      NaN         79   84.0      88.0   82.0     85.0
5            Eshwar N     88.0         91   89.0      90.0   45.0     79.0
6             Farah K     76.0         85   95.0      80.0   88.0      NaN

In [4]:
df.loc[1]

Name         Anil Kumar
Physics            85.0
Chemistry            78
Maths              92.0
Computer            NaN
Hindi              80.0
Kannada            88.0
Name: 1, dtype: object

In [6]:
df.loc[[2,4]]

                 Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
StudentID
2          Bharathi R     90.0         80   88.0      94.0   85.0     55.0
4             Divya P      NaN         79   84.0      88.0   82.0     85.0

In [7]:
df.loc[3,'Physics']

np.float64(78.0)

In [9]:
df.loc[1:4,'Physics']

StudentID
1    85.0
2    90.0
3    78.0
4     NaN
Name: Physics, dtype: float64

In [11]:
df.loc[df['Physics']<80]

                Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
StudentID
3          Chandan S     78.0         84    NaN      86.0    NaN     81.0
6            Farah K     76.0         85   95.0      80.0   88.0      NaN

In [12]:
df.loc[df['Physics']<80,['Maths']]

           Maths
StudentID
3            NaN
6           95.0

In [13]:
df.iloc[0]

Name         Anil Kumar
Physics            85.0
Chemistry            78
Maths              92.0
Computer            NaN
Hindi              80.0
Kannada            88.0
Name: 1, dtype: object

In [15]:
df.iloc[[0,2]]

                 Name  Physics  Chemistry  Maths  Computer  Hindi  Kannada
StudentID
1          Anil Kumar     85.0         78   92.0       NaN   80.0     88.0
3           Chandan S     78.0         84    NaN      86.0    NaN     81.0

In [18]:
df.iloc[:,0]

StudentID
1    Anil Kumar
2    Bharathi R
3     Chandan S
4       Divya P
5      Eshwar N
6       Farah K
Name: Name, dtype: object

In [19]:
df.iloc[1:5,2:5]

           Chemistry  Maths  Computer
StudentID
2                 80   88.0      94.0
3                 84    NaN      86.0
4                 79   84.0      88.0
5                 91   89.0      90.0